app/controllers/dashboard_controller.rb

SELECT * FROM `users` WHERE (`users`.`fb_id` = '100000097783521') LIMIT 1
---
  def index
    @oauth_url = MiniFB.oauth_url(FB_APP_ID, HOST + "sessions/create",
                                  :scope=>MiniFB.scopes.join(","))
    unless params[:q].blank?
      MiniFB.enable_logging

      #search users by status
      params[:url].blank? ? url = "http://graph.facebook.com/search?q=#{params[:q]}&type=post" : url = params[:url]
      @res = MiniFB.fetch(url)

      #save to user table
      unless @res["data"].blank?
      @res["data"].each do |r|
        user = User.find_by_fb_id(r['from']['id'])